app/views/orders/index.html.erb

SELECT `orders`.* FROM `orders`
---
        <td><%= order.status %></td>
        <td><%= order.orderdate %></td>