app/views/orders/new.html.erb


$(document).on("click", ".add_to_order", function(event){
  var input = $(this).prev('h5')[0].textContent;
  var price = $(this).closest("div").prev('.price_av')[0].textContent;
  var id_pro = $(this).attr('id');
  var li = '<li class="order" id="'+id_pro+'"><span class="product">'+input+'</span>\
          <input type="text" name="num_q" value="1" class="num_q form-control input-form">\
            <span class="plus-span">\
              <i class="fa fa-plus plus" aria-hidden="true"></i>\
              <i class="fa fa-minus" aria-hidden="true"></i>\
            </span>\
            <input type="hidden" class="basic_price" name="basic_price" value="'+price+'">\
            <span class="price">'+price+'</span>\
            <span class="delete"><i class="fa fa-times" aria-hidden="true"></i></span>\
          </li>';
  var flag = false;
$(function(){
  $(".order ul li").each(function(){
      var id = $(this).find('div.page#'+id_pro+'');
      if(id.context.id == id_pro){

        flag = true;
---
SELECT `products`.* FROM `products`