app/controllers/orderproducts_controller.rb

INSERT INTO `order_products` (`product_name`, `quantity`, `price`, `orders_id`, `created_at`, `updated_at`) VALUES ('cafe', 1, 10, 103, '2017-03-29 18:31:58', '2017-03-29 18:31:58')
---
  def create
    # @order_product = @order.find(params[:id])
    quantity = params[:quantity]
    price = params[:price]
    order_id = params[:order_id]
    product_name = params[:product_name]
    @orderProduct = OrderProduct.new(:product_name => product_name,:price => price,:orders_id => order_id, :quantity => quantity)
    @orderProduct.save()