app/controllers/orders_controller.rb

  def index
    @orders = Order.where(user_id: current_user)
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`user_id` IS NULL

  def show
   @orders = Order.where(user_id: current_user)
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`user_id` = 15

  def new
    @products = Product.all
---
SELECT `products`.* FROM `products`

  def create
    # @user = User.find(params[:user_id])
    @order = current_user.orders.build(order_params)
    respond_to do |format|
    if @order.save(order_params)
---
INSERT INTO `orders` (`orderdate`, `notes`, `user_id`, `created_at`, `updated_at`) VALUES ('2017-03-28 06:15:00', '', 1, '2017-03-28 06:16:09', '2017-03-28 06:16:09')