app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `ext`, `room_no`, `admin`, `created_at`, `updated_at`) VALUES ('ad', 1, 1, 1, '2017-03-24 04:01:03', '2017-03-24 04:01:03')